Synthesizing design: sensor_b.sv

                      Design Compiler Graphical
                            DC Ultra (TM)
                             DFTMAX (TM)
                         Power Compiler (TM)
                           DesignWare (R)
                           DC Expert (TM)
                         Design Vision (TM)
                          HDL Compiler (TM)
                         VHDL Compiler (TM)
                            DFT Compiler
                        Library Compiler (TM)
                         Design Compiler(R)

            Version G-2012.06 for RHEL64 -- May 30, 2012
               Copyright (c) 1988-2012 Synopsys, Inc.

This software and the associated documentation are confidential and 
proprietary to Synopsys, Inc. Your use or disclosure of this software 
is subject to the terms and conditions of a written license agreement 
between you, or your company, and Synopsys, Inc.

Initializing...
dc_shell> dc_shell> Running PRESTO HDLC
Searching for ./sensor_b.sv
Searching for /package/eda/synopsys/syn-G-2012.06/libraries/syn/sensor_b.sv
Searching for /package/eda/synopsys/syn-G-2012.06/dw/sim_ver/sensor_b.sv
Searching for ./source/sensor_b.sv
Compiling source file ./source/sensor_b.sv
Presto compilation completed successfully.
Loading db file '/package/eda/cells/OSU/v2.7/synopsys/lib/ami05/osu05_stdcells.db'
Loading db file '/package/eda/synopsys/syn-G-2012.06/libraries/syn/dw_foundation.sldb'
1
dc_shell> Loading db file '/package/eda/synopsys/syn-G-2012.06/libraries/syn/gtech.db'
Loading db file '/package/eda/synopsys/syn-G-2012.06/libraries/syn/standard.sldb'
  Loading link library 'osu05_stdcells'
  Loading link library 'gtech'
Running PRESTO HDLC
Presto compilation completed successfully.
Elaborated 1 design.
Current design is now 'sensor_b'.
1
dc_shell> dc_shell> dc_shell> dc_shell> 1
dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> Information: Evaluating DesignWare library utilization. (UISN-27)

============================================================================
| DesignWare Building Block Library  |         Version         | Available |
============================================================================
| Basic DW Building Blocks           | G-2012.06-DWBB_201206.0 |     *     |
| Licensed DW Building Blocks        | G-2012.06-DWBB_201206.0 |           |
============================================================================



  Beginning Pass 1 Mapping
  ------------------------
  Processing 'sensor_b'

  Updating timing information
Information: Updating design information... (UID-85)

  Beginning Mapping Optimizations  (Medium effort)
  -------------------------------
  Mapping Optimization (Phase 1)

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          



  Beginning Delay Optimization Phase
  ----------------------------------

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          


  Beginning Area-Recovery Phase  (cleanup)
  -----------------------------

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
Loading db file '/package/eda/cells/OSU/v2.7/synopsys/lib/ami05/osu05_stdcells.db'

  Optimization Complete
  ---------------------
1
dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> Writing verilog file '/home/ecegrid/a/mg104/ece337/Lab2/mapped/sensor_b.v'.
1
dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> 1
dc_shell> 

  Beginning Pass 1 Mapping
  ------------------------
  Processing 'sensor_b'

  Updating timing information
Information: Updating design information... (UID-85)

  Beginning Mapping Optimizations  (High effort)
  -------------------------------
  Mapping Optimization (Phase 1)

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          



  Beginning Delay Optimization Phase
  ----------------------------------

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          


  Beginning Area-Recovery Phase  (cleanup)
  -----------------------------

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
    0:00:00     720.0      0.00       0.0       0.0                          
Loading db file '/package/eda/cells/OSU/v2.7/synopsys/lib/ami05/osu05_stdcells.db'

  Optimization Complete
  ---------------------
1
dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> Writing verilog file '/home/ecegrid/a/mg104/ece337/Lab2/mapped/sensor_b_1.v'.
1
dc_shell> dc_shell> 
Script Done

dc_shell> 
Checking Design

dc_shell> 1
dc_shell> 
Thank you...
Done


